---
kind: type
id: T:Autodesk.Revit.DB.CylindricalHelix
source: html/fdaa7f4a-e680-8d7e-3a9b-677b082432f5.htm
---
# Autodesk.Revit.DB.CylindricalHelix

A cylindrical helix.

## Syntax (C#)
```csharp
public class CylindricalHelix : Curve
```

## Remarks
The helix winds around a cylinder making constant angle with the axis of the cylinder.
 In this release, CylindricalHelix curves are used only in specific applications in
 stairs and railings, and should not be used or encountered when accessing curves of
 other Revit elements and geometry.